src/cf/Catalogs/УчетныеЗаписиВнешнихКалендарей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиВнешнихКалендарей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСинхронизацииКалендарей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогКалендарей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/УчетныеЗаписиВнешнихКалендарей/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Код = "" Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	УчетныеЗаписиВнешнихКалендарей.Код КАК Код,
		|	УчетныеЗаписиВнешнихКалендарей.Наименование КАК Наименование
		|ИЗ
		|	Справочник.УчетныеЗаписиВнешнихКалендарей КАК УчетныеЗаписиВнешнихКалендарей
		|ГДЕ
		|	УчетныеЗаписиВнешнихКалендарей.Наименование = &Наименование
		|	И УчетныеЗаписиВнешнихКалендарей.Провайдер = &Провайдер");
		Запрос.УстановитьПараметр("Наименование", ЭтотОбъект.Наименование);
		Запрос.УстановитьПараметр("Провайдер", ЭтотОбъект.Провайдер);
		
		РезультатВыполнения = Запрос.Выполнить();

		Если Не РезультатВыполнения.Пустой() Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.НастройкиСинхронизацииСВнешнимиКалендарями.УдалитьНастройкиПоУчетнойЗаписиВнешнегоКалендаря(ЭтотОбъект.Ссылка);
	РегистрыСведений.ДанныеСобытийВнешнихКалендарей.УдалитьСобытияПоУчетнойЗаписиВнешнегоКалендаря(ЭтотОбъект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
